#include <stdio.h>

int main(void)
{
	int num = 15;	// 00000000 00000000 00000000 00001111

	int result1 = num << 1;		// numÀÇ ºñÆ® ¿­À» ¿ŞÂÊÀ¸·Î 1Ä­¾¿ ÀÌµ¿ -> 00011110 <- ¿ŞÂÊÀ¸·Î 1Ä­ÀÌµ¿
	int result2 = num << 2;		// numÀÇ ºñÆ® ¿­·Î ¿ŞÂÊÀ¸·Î 2Ä­¾¿ ÀÌµ¿ -> 00111100 <-    "     2Ä­ÀÌµ¿
	int result3 = num << 3;		// numÀÇ ºñÆ® ¿­·Î ¿ŞÂÊÀ¸·Î 2Ä­¾¿ ÀÌµ¿ -> 01111000 <-	 "     3Ä­ÀÌµ¿
	 
	printf("1Ä­¾¿ ÀÌµ¿ °á°ú: %d \n", result1);
	printf("2Ä­¾¿ ÀÌµ¿ °á°ú: %d \n", result2);
	printf("3Ä­¾¿ ÀÌµ¿ °á°ú: %d \n", result3);
	return 0;
}